ycsb/cassandra-releases_3-batch_3.0.25_1_f6zI8Lkd/0_load.txt
[WARN]  The 'cassandra2-cql' client has been deprecated. It has been renamed to simply 'cassandra-cql'. This alias will be removed in the next YCSB release.
/usr/lib/jvm/java-8-openjdk-amd64/bin/java -cp /home/developer/benchmarks/ycsb/cassandra-binding/conf:/home/developer/benchmarks/ycsb/conf:/home/developer/benchmarks/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/developer/benchmarks/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/developer/benchmarks/ycsb/lib/core-0.17.0.jar:/home/developer/benchmarks/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/developer/benchmarks/ycsb/lib/HdrHistogram-2.1.4.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/cassandra-driver-core-3.0.0.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/slf4j-api-1.7.25.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/netty-handler-4.0.33.Final.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/netty-buffer-4.0.33.Final.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/cassandra-binding-0.17.0.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/netty-transport-4.0.33.Final.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/guava-16.0.1.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/metrics-core-3.1.2.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/netty-codec-4.0.33.Final.jar site.ycsb.Client -db site.ycsb.db.CassandraCQLClient -s -p hosts=172.31.47.249,172.31.40.105,172.31.42.134 -p cassandra.keyspace=ycsb -p cassandra.writeconsistencylevel=ONE -p workload=site.ycsb.workloads.CoreWorkload -p maxexecutiontime=1800 -threads 64 -p recordcount=2000000 -p operationcount=10000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.2 -p updateproportion=0.0 -p insertproportion=0.8 -p scanproportion=0.0 -p maxscanlength=1000 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.CassandraCQLClient -s -p hosts=172.31.47.249,172.31.40.105,172.31.42.134 -p cassandra.keyspace=ycsb -p cassandra.writeconsistencylevel=ONE -p workload=site.ycsb.workloads.CoreWorkload -p maxexecutiontime=1800 -threads 64 -p recordcount=2000000 -p operationcount=10000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.2 -p updateproportion=0.0 -p insertproportion=0.8 -p scanproportion=0.0 -p maxscanlength=1000 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
Maximum execution time specified as: 1800 secs
2021-08-06 08:47:10:762 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2021-08-06 08:47:20:741 10 sec: 53511 operations; 5350.56 current ops/sec; est completion in 6 minutes [INSERT: Count=53511, Max=328447, Min=450, Avg=11093.55, 90=25151, 99=54527, 99.9=279039, 99.99=297983] 
2021-08-06 08:47:30:741 20 sec: 136437 operations; 8292.6 current ops/sec; est completion in 4 minutes [INSERT: Count=82926, Max=409087, Min=430, Avg=7712.32, 90=17791, 99=29711, 99.9=353023, 99.99=392447] 
2021-08-06 08:47:40:741 30 sec: 222632 operations; 8619.5 current ops/sec; est completion in 4 minutes [INSERT: Count=86195, Max=428287, Min=401, Avg=7418.67, 90=15647, 99=28847, 99.9=337407, 99.99=423423] 
2021-08-06 08:47:50:741 40 sec: 306188 operations; 8355.6 current ops/sec; est completion in 3 minutes [INSERT: Count=83556, Max=434175, Min=396, Avg=7603.99, 90=14959, 99=29519, 99.9=401663, 99.99=431103] 
2021-08-06 08:48:00:741 50 sec: 403210 operations; 9702.2 current ops/sec; est completion in 3 minutes [INSERT: Count=97022, Max=353791, Min=371, Avg=6489.18, 90=13295, 99=28847, 99.9=318207, 99.99=336383] 
2021-08-06 08:48:10:741 60 sec: 495154 operations; 9194.4 current ops/sec; est completion in 3 minutes [INSERT: Count=91944, Max=565759, Min=373, Avg=7105.59, 90=12367, 99=48319, 99.9=359679, 99.99=535551] 
2021-08-06 08:48:20:741 70 sec: 583718 operations; 8856.4 current ops/sec; est completion in 2 minutes [INSERT: Count=88564, Max=1677311, Min=337, Avg=7231.55, 90=12687, 99=49855, 99.9=449279, 99.99=1675263] 
2021-08-06 08:48:30:741 80 sec: 671368 operations; 8765 current ops/sec; est completion in 2 minutes [INSERT: Count=87650, Max=5935103, Min=365, Avg=7256.04, 90=12295, 99=46815, 99.9=427007, 99.99=445951] 
2021-08-06 08:48:40:741 90 sec: 754829 operations; 8346.1 current ops/sec; est completion in 2 minutes [INSERT: Count=83463, Max=4317183, Min=371, Avg=7710.59, 90=13847, 99=75455, 99.9=454655, 99.99=464639] 
2021-08-06 08:48:50:741 100 sec: 851607 operations; 9677.8 current ops/sec; est completion in 2 minutes [INSERT: Count=96780, Max=1211391, Min=366, Avg=6611.16, 90=11719, 99=29663, 99.9=427007, 99.99=460799] 
2021-08-06 08:49:00:741 110 sec: 946719 operations; 9511.2 current ops/sec; est completion in 2 minutes [INSERT: Count=95116, Max=483071, Min=367, Avg=6728.59, 90=12839, 99=30623, 99.9=388095, 99.99=475647] 
2021-08-06 08:49:10:741 120 sec: 1044638 operations; 9791.9 current ops/sec; est completion in 1 minute [INSERT: Count=97918, Max=559615, Min=340, Avg=6533.1, 90=11295, 99=31391, 99.9=418559, 99.99=556031] 
2021-08-06 08:49:20:741 130 sec: 1144860 operations; 10022.2 current ops/sec; est completion in 1 minute [INSERT: Count=100215, Max=2224127, Min=352, Avg=6304.7, 90=11479, 99=27263, 99.9=407807, 99.99=467711] 
2021-08-06 08:49:30:741 140 sec: 1243653 operations; 9879.3 current ops/sec; est completion in 1 minute [INSERT: Count=98808, Max=2330623, Min=339, Avg=6553.94, 90=11455, 99=40063, 99.9=332543, 99.99=413695] 
2021-08-06 08:49:40:741 150 sec: 1338679 operations; 9502.6 current ops/sec; est completion in 1 minute [INSERT: Count=95011, Max=435967, Min=330, Avg=6728.22, 90=11887, 99=34783, 99.9=393215, 99.99=399871] 
2021-08-06 08:49:50:741 160 sec: 1440253 operations; 10157.4 current ops/sec; est completion in 1 minute [INSERT: Count=101582, Max=438783, Min=353, Avg=6299.86, 90=12143, 99=33727, 99.9=343807, 99.99=435455] 
2021-08-06 08:50:00:741 170 sec: 1531696 operations; 9144.3 current ops/sec; est completion in 52 seconds [INSERT: Count=91435, Max=592383, Min=341, Avg=6995.78, 90=12831, 99=33887, 99.9=418815, 99.99=551935] 
2021-08-06 08:50:10:741 180 sec: 1635256 operations; 10356 current ops/sec; est completion in 41 seconds [INSERT: Count=103586, Max=447487, Min=353, Avg=6175.53, 90=12479, 99=27887, 99.9=409855, 99.99=442367] 
2021-08-06 08:50:20:741 190 sec: 1721146 operations; 8589 current ops/sec; est completion in 31 seconds [INSERT: Count=85867, Max=537087, Min=358, Avg=7448.97, 90=12063, 99=51679, 99.9=479999, 99.99=513279] 
2021-08-06 08:50:30:741 200 sec: 1822135 operations; 10098.9 current ops/sec; est completion in 20 seconds [INSERT: Count=100986, Max=416767, Min=377, Avg=6289.71, 90=12103, 99=29023, 99.9=387071, 99.99=409855] 
2021-08-06 08:50:40:741 210 sec: 1909197 operations; 8706.2 current ops/sec; est completion in 10 seconds [INSERT: Count=87062, Max=623103, Min=354, Avg=7393.55, 90=13015, 99=35743, 99.9=519423, 99.99=581119] 
2021-08-06 08:50:50:741 220 sec: 2000000 operations; 9080.3 current ops/sec; [CLEANUP: Count=63, Max=8, Min=1, Avg=3.3, 90=5, 99=6, 99.9=8, 99.99=8] [INSERT: Count=90803, Max=439807, Min=364, Avg=5696.33, 90=11007, 99=25599, 99.9=371967, 99.99=380671] 
Could not wait until max specified time, TerminatorThread interrupted.
2021-08-06 08:50:52:652 221 sec: 2000000 operations; 0 current ops/sec; [CLEANUP: Count=1, Max=2213887, Min=2211840, Avg=2212864, 90=2213887, 99=2213887, 99.9=2213887, 99.99=2213887] [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
[OVERALL], RunTime(ms), 221911
[OVERALL], Throughput(ops/sec), 9012.622177359392
[TOTAL_GCS_PS_Scavenge], Count, 900
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1785
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.8043765293293257
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 900
[TOTAL_GC_TIME], Time(ms), 1785
[TOTAL_GC_TIME_%], Time(%), 0.8043765293293257
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 34579.25
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2213887
[CLEANUP], 95thPercentileLatency(us), 5
[CLEANUP], 99thPercentileLatency(us), 8
[INSERT], Operations, 2000000
[INSERT], AverageLatency(us), 6952.067037
[INSERT], MinLatency(us), 330
[INSERT], MaxLatency(us), 5935103
[INSERT], 95thPercentileLatency(us), 17855
[INSERT], 99thPercentileLatency(us), 35775
[INSERT], Return=OK, 2000000